       IDENTIFICATION DIVISION.
       PROGRAM-ID. READFILE.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT INPUT-FILE ASSIGN TO 'inputfile.txt'
           ORGANIZATION IS LINE SEQUENTIAL
           FILE STATUS IS WS-STATUS.
           SELECT OUTPUT-FILE ASSIGN TO 'outputfile.txt'
           ORGANIZATION IS LINE SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.
       FD  INPUT-FILE.
       01  INPUT-RECORD.
           05  INPUT-DATA    PIC X(80).
       FD  OUTPUT-FILE.
       01  OUTPUT-RECORD.
           05  OUTPUT-DATA    PIC X(80).
       WORKING-STORAGE SECTION.
       01  WS-STATUS         PIC XX.
           88  EndOfFile       VALUE '10'.
           88  NoErrors        VALUE '00'.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           OPEN INPUT INPUT-FILE
           OUTPUT OUTPUT-FILE.
               READ INPUT-FILE.
           PERFORM UNTIL WS-STATUS NOT EQUAL TO '00'
           PERFORM 1000-PROCESS
           END-PERFORM.
               CLOSE INPUT-FILE.
           STOP RUN.
       1000-PROCESS.
           DISPLAY INPUT-DATA.
           WRITE OUTPUT-RECORD FROM INPUT-RECORD.
